package YandexScooterSite;

import org.openqa.selenium.WebDriver;

public class HomePage {
    // Вопрос 1. Сколько это стоит? И как оплатить?
    // Вопрос 2. Хочу сразу несколько самокатов! Так можно?
    // Вопрос 3. Как рассчитывается время аренды?
    // Вопрос 4. Можно ли заказать самокат прямо на сегодня?
    // Вопрос 5. Можно ли продлить заказ или вернуть самокат раньше?
    // Вопрос 6. Вы привозите зарядку вместе с самокатом?
    // Вопрос 7. Можно ли отменить заказ?
    // Вопрос 8. Я жизу за МКАДом, привезёте?

    // Поле "Имя" на форме "Для кого самокат"
    // Поле "Фамилия" на форме "Для кого самокат"
    // Поле "Адрес" на форме "Для кого самокат"
    // Поле "Станция метро" на форме "Для кого самокат"
    // Первый пункт выпадающего меню "Станция метро"
    // Поле "Телефон" на форме "Для кого самокат"
    // Кнопка "Далее" на форме "Для кого самокат"

    // Поле "Когда привезти самокат" на форме "Про аренду"
    // Сегодняшняя дата в выпадающем календаре на форме "Про аренду"
    // Поле "Срок аренды" на форме "Про аренду"
    // Первый пункт выпадающего меню "Срок аренды" на форме "Про аренду"
    // Кнопка "Заказать" на второй форме заказа
    // Кнопка "Да" на всплывающем окне "Хотите оформить заказ?"
    // Заголовок "Заказ оформлен"

    public HomePage(WebDriver driver) {
    }

    // Метод клик по кнопке
    // Метод заполнения полей "Для кого самокат"
    // Метод заполнения полей "Про аренду"
    // Вспомогательные методы для заполнения полей
}
